subjects = {
	'分析力学':{
		'type':'simple',
		'data':[33,2],
		"chapter_names":['泛函分析','最小作用量原理']
	},

	"电磁学": {
		"type": "simple",
		"data": [30, 40, 20, 33, 28, 29, 25, 13],
		"chapter_names": ["静电场", "恒定磁场", "电磁感应",
		                  "交流电路", "电磁波", "相对论电磁学",
		                  "电磁辐射", "综合应用"]
	},
	"概率论": {
		"type": "detailed",
		"data": [
			["随机事件与概率", [11, 30, 23, 33, 25]],
			["随机变量及其分布", [19, 21, 14, 20, 34, 18, 13]],
			["多维随机变量", [15, 16, 21, 49, 18]],
			["数字特征", [20, 15, 17, 27]],
			["大数定律", [6, 7, 36, 22, 20]],
			["统计量及其分布", [11, 7, 10, 15, 14, 19]],
			["参数估计", [8, 27, 11, 15, 4, 8]],
			["假设检验", [8, 4, 6, 11, 7]]
		]
	}
}