subjects = {
	"电磁学通论(钟锡华)": {
		"type": "simple",
		"data": [30, 40, 20, 33, 28, 29, 25, 13],
		"chapter_names": ["静电场", "静电场中的导体", "电流场",
		                  "恒定磁场", "磁介质", "电磁感应",
		                  "交流电路", "麦克斯韦理论"]
	},
	"概率论与数理统计(茆诗松)": {
		"type": "detailed",
		"data": [
			["随机事件与概率", [11, 30, 23, 33, 25]],
			["随机变量及其分布", [19, 21, 14, 20, 34, 18, 13]],
			["多维随机变量", [15, 16, 21, 49, 18]],
			["大数定律", [20, 15, 17, 27]],
			["统计量及其分布", [6, 7, 36, 22, 20]],
			["参数估计", [11, 7, 10, 15, 14, 19]],
			["假设检验", [8, 27, 11, 15, 4, 8]],
			["方差分析与回归分析", [8, 4, 6, 11, 7]]
		]
	},
	'数学竞赛红本':{
		'type':'detailed',
		'data' : [
      ['极限', [72, 66]],
      ['一元微分学', [75, 75]],
      ['一元积分学', [102, 63]],
      ['常微分方程', [58, 39]],
      ['解析几何', [40, 34]],
      ['多元微分', [72, 40]],
      ['多元积分学', [121, 66]],
      ['无穷级数', [80, 65]]
		]
	}
}